###############################################################################
# Created by write_sdc
# Mon Dec 11 20:11:08 2023
###############################################################################
current_design DDS_Module
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 24.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Enable}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Enable}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[0]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[0]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[10]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[10]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[11]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[11]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[12]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[12]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[13]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[13]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[14]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[14]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[15]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[15]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[1]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[1]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[2]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[2]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[3]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[3]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[4]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[4]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[5]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[5]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[6]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[6]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[7]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[7]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[8]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[8]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {FreqPhase[9]}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {FreqPhase[9]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {LoadF}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {LoadF}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {LoadP}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {LoadP}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {rst}]
set_input_delay 9.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {rst}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[0]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[10]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[10]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[11]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[11]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[12]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[12]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[13]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[13]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[14]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[14]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[15]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[15]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[1]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[2]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[3]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[4]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[5]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[6]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[7]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[8]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cos_Out[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cos_Out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {Cos_Out[15]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[14]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[13]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[12]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[11]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[10]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[9]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[8]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[7]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[6]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[5]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[4]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[3]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[2]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[1]}]
set_load -pin_load 0.1900 [get_ports {Cos_Out[0]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 150.0000 [current_design]
